In [1]:
# pandas open source analysis

In [2]:
import pandas as pd

In [27]:
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [28]:
import pandas as pd

lst = ['Geeks', 'For', 'Geeks', 'is', 
            'portal', 'for', 'Geeks']

df = pd.DataFrame(lst)
print(df)

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [ ]:
import pandas as pd
data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'],
        'Age': [25, 30, 22, 35, 28],
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
        'Salary': [50000, 55000, 40000, 70000, 48000]}

df = pd.DataFrame(data)
print(df.index)  # Accessing the index

RangeIndex(start=0, stop=5, step=1)

In [31]:
import pandas as pd

data = {'Name': ['John', 'Alice', 'Bob', 'Eve', 'Charlie'],
        'Age': [25, 30, 22, 35, 28],
        'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
        'Salary': [50000, 55000, 40000, 70000, 48000]}

df = pd.DataFrame(data)
print(df.rank)  # Accessing the shape

<bound method NDFrame.rank of       Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000>

In [32]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.000000  52600.000000
std     4.949747  11126.544837
min    22.000000  40000.000000
25%    25.000000  48000.000000
50%    28.000000  50000.000000
75%    30.000000  55000.000000
max    35.000000  70000.000000

In [33]:
df.shape

(5, 4)

In [34]:
df.values

array([['John', 25, 'Male', 50000],
       ['Alice', 30, 'Female', 55000],
       ['Bob', 22, 'Male', 40000],
       ['Eve', 35, 'Female', 70000],
       ['Charlie', 28, 'Male', 48000]], dtype=object)

In [37]:
df.reset_index

<bound method DataFrame.reset_index of       Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000>

In [44]:
df = pd.DataFrame(data)
df

      Name  Age  Gender  Salary
0     John   25    Male   50000
1    Alice   30  Female   55000
2      Bob   22    Male   40000
3      Eve   35  Female   70000
4  Charlie   28    Male   48000

In [46]:
row = df.iloc[0]
print(row)

Name       John
Age          25
Gender     Male
Salary    50000
Name: 0, dtype: object

In [8]:
df=pd.DataFrame([[1,2,3],[4,5,6]])
df

   0  1  2
0  1  2  3
1  4  5  6

In [ ]:
df=pd.DataFrame([[1,2,3],[4,5,6]], columns = ['a','b','c'])
df

   a  b  c
0  1  2  3
1  4  5  6

In [9]:
df.shape

(2, 3)

In [10]:
df.columns

RangeIndex(start=0, stop=3, step=1)

In [11]:
df.values

array([[1, 2, 3],
       [4, 5, 6]])

In [12]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [15]:
data1 = {
    "ID": [1, 2, 3],
    "Name": ["Aarav", "Priya", "Vikram"],
    "Score": [85, 90, 78]
}
df1 = pd.DataFrame(data1)
df1

   ID    Name  Score
0   1   Aarav     85
1   2   Priya     90
2   3  Vikram     78

In [16]:
data4 = [
    (1, "Meera", 91),
    (2, "Sanjay", 84),
    (3, "Divya", 87)
]
df4 = pd.DataFrame(data4, columns=["ID", "Name", "Score"])
df4

   ID    Name  Score
0   1   Meera     91
1   2  Sanjay     84
2   3   Divya     87

In [23]:
import numpy as np
df = pd.DataFrame(np.random.randint(1, 10,(5, 5)), columns=('p1', 'p2', 'p3', 'p4', 'p5'), index=('s1', 's2', 's3', 's4', 's5'))
df

    p1  p2  p3  p4  p5
s1   7   5   9   3   2
s2   5   2   5   7   8
s3   5   5   7   5   6
s4   1   1   7   3   4
s5   3   5   2   5   5